In [27]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.model_selection import cross_val_score

In [28]:
Titanic_Data = pd.read_csv("Data/titanic_data.csv")
Titanic_Data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [29]:
Missing_Values = Titanic_Data.isnull().sum()
Missing_Values

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [30]:
Total_Cells = np.product(Titanic_Data.shape)
Total_Missing_Cells = Missing_Values.sum()

(Total_Missing_Cells/Total_Cells) * 100

8.099513655069211

In [31]:
Titanic_Data["Sex"]=Titanic_Data["Sex"].replace(['female','male'],[0,1])
Titanic_Data["Age"].fillna(Titanic_Data.Age.median(),inplace=True)
Titanic_Data["Embarked"].fillna(Titanic_Data.Embarked.mode()[0],inplace=True)
Titanic_Data.drop(['Cabin','Name','PassengerId','Ticket'],axis=1,inplace=True)

In [32]:

Titanic_Data[["Embarked","Survived"]].groupby(['Embarked'],as_index=False).mean().sort_values(by='Survived',ascending =False)

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.339009

In [33]:
Titanic_Data["Embarked"] = Titanic_Data["Embarked"].replace(['C','Q','S'],[0,1,2])
Titanic_Data.dtypes

Survived      int64
Pclass        int64
Sex           int64
Age         float64
SibSp         int64
Parch         int64
Fare        float64
Embarked      int64
dtype: object

In [34]:
Titanic_Data.corr()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
Survived,1.000000,-0.338481,-0.543351,-0.064910,-0.035322,0.081629,0.257307,-0.167675
Pclass,-0.338481,1.000000,0.131900,-0.339898,0.083081,0.018443,-0.549500,0.162098
Sex,-0.543351,0.131900,1.000000,0.081163,-0.114631,-0.245489,-0.182333,0.108262
Age,-0.064910,-0.339898,0.081163,1.000000,-0.233296,-0.172482,0.096688,-0.018754
SibSp,-0.035322,0.083081,-0.114631,-0.233296,1.000000,0.414838,0.159651,0.068230
Parch,0.081629,0.018443,-0.245489,-0.172482,0.414838,1.000000,0.216225,0.039798
Fare,0.257307,-0.549500,-0.182333,0.096688,0.159651,0.216225,1.000000,-0.224719
Embarked,-0.167675,0.162098,0.108262,-0.018754,0.068230,0.039798,-0.224719,1.000000

In [35]:
Y = Titanic_Data["Survived"]
X = Titanic_Data.drop(["Survived"],axis=1)
X_train , X_test , Y_train , Y_test = train_test_split(X,Y,test_size=0.2)
print(f"Train size {X_train.shape[0]} rows\nTest size {X_test.shape[0]} rows")

Train size 712 rows
Test size 179 rows